In [2]:
#!pip install openpyxl
import sqlite3
import pandas as pd

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 KB 1.9 MB/s eta 0:00:00 MB/s eta 0:00:01
Collecting et-xmlfile
  Using cached et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

Первый шаг - сохранить xlsx файл как таблицу.

Эти действия выполним 1 раз.

In [4]:
# создаем подключение к sqlite (параметр - имя базы)
conn = sqlite3.connect('mydb.db')
# читаем excel файл (параметры - имя файла и имя листа в файле)
wb = pd.read_excel('pokemon.xlsx', sheet_name = 'Sheet1')
# записываем его в базу как таблицу (параметр name - имя таблицы)
wb.to_sql(name='pokemon', con=conn, if_exists='replace', index=True)
# сохраняем
conn.commit()
# закрывам соединение
conn.close()

Теперь можем работать с данными с помощью sql.

In [12]:
query = '''SELECT name 
           FROM pokemon
           LIMIT 10
        '''

In [13]:
# вариант 1 - через библиотеку sqlite
conn = sqlite3.connect("mydb.db")
cur = con.cursor()

cur.execute(query)

data = cur.fetchall()

data

[('Bulbasaur',),
 ('Ivysaur',),
 ('Venusaur',),
 ('VenusaurMega Venusaur',),
 ('Charizard',),
 ('CharizardMega Charizard X',),
 ('CharizardMega Charizard Y',),
 ('Butterfree',),
 ('Weedle',),
 ('Kakuna',)]

In [9]:
c.close()

In [14]:
# вариант 2 - через pandas
# можно передавать вторым параметром объект Connection 
df = pd.read_sql_query(query, con)
df

                        name
0                  Bulbasaur
1                    Ivysaur
2                   Venusaur
3      VenusaurMega Venusaur
4                  Charizard
5  CharizardMega Charizard X
6  CharizardMega Charizard Y
7                 Butterfree
8                     Weedle
9                     Kakuna

In [15]:
# так же можем передавать данные подключения в виде строки
df = pd.read_sql_query(query, "sqlite:///mydb.db")
df

                        name
0                  Bulbasaur
1                    Ivysaur
2                   Venusaur
3      VenusaurMega Venusaur
4                  Charizard
5  CharizardMega Charizard X
6  CharizardMega Charizard Y
7                 Butterfree
8                     Weedle
9                     Kakuna